# task 01 == Виправте синтаксичні помилки

print("Hello", end = " ")
print("world!")

# task 02 == Виправте синтаксичні помилки
hello = "Hello"
world = "world"
if True:
    print(f"{hello} {world}!")

# task 03  == Вcтавте пропущену змінну у ф-цію print
for letter in "Hello world!":
    print(letter)

# task 04 == Зробіть так, щоб кількість бананів була
# завжди в чотири рази більша, ніж яблук
apples = 2
banana = apples * 4

# task 05 == виправте назви змінних
storona_1 = 1
storona_2 = 2
storona_3 = 3
storona_4 = 4
# можна змінні назвати side_1, side_2, side_3, side_4

# task 06 == Порахуйте периметр фігури з task 05
# та виведіть його для користувача
perimeter = storona_1 + storona_2 + storona_3 + storona_4
print(perimeter)


"""
    Задачі 07 -10:
    Переведіть задачі з книги "Математика, 2 клас"
    на мову пітон і виведіть відповідь, так, щоб було
    зрозуміло дитині, що навчається в другому класі
"""
# task 07
"""
У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?
"""
trees_apples = 4
trees_pears = trees_apples + 5
trees_plums = trees_apples - 2

total_trees = trees_apples + trees_pears + trees_plums

print(f"Всього посаджено {total_trees} дерев в саду")

# task 08
"""
До обіда температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?
"""
# В слові обіда помилка, правильніше обіду

temperature_before_lunch = 5
temperature_after_lunch = temperature_before_lunch - 10
temperature_evening = temperature_after_lunch + 4

print(f"Температура надвечір - {temperature_evening} градусів")

"""
якщо не перевикористовувати змінну а просто вивести кількість то простіше записати так:
count_boys = 24
print(f"Сьогодні в театральному гуртку {count_boys - 1 + count_boys // 2 - 2}")
"""

# task 09
"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скількі сьогодні дітей у театральному гуртку?
"""
# В слові Скількі помилка, правильно Скільки

count_boys = 24
count_girls = count_boys // 2 # цілочисельне ділення оскільки кількість дівчаток не може бути дробовою

total_children = count_boys - 1 + count_girls - 2 # якщо хворий хлопчик не прийшов, а то можливо батьки його привели
                                                  # не зважаючи на хворобу

print(f"Сьогодні в театральному гуртку {total_children} дітей")

"""
якщо не перевикористовувати змінну а просто вивести кількість то простіше записати так:
count_boys = 24
print(f"Сьогодні в театральному гуртку {count_boys - 1 + count_boys // 2 - 2}")
"""

# task 10
"""
Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""
# В слові дороже помилка, правильно дорожче

first_book = 8
second_book = first_book + 2
third_book = (first_book + second_book) / 2

total_price = first_book + second_book + third_book

print(f"Усі книги разом коштують {total_price} грн.")

f"""
якщо не перевикористовувати змінну а просто вивести кількість то простіше записати так:
first_book = 8
print(f"Усі книги разом коштують {first_book + first_book + 2 + (first_book + first_book + 2) / 2} грн.")
"""
