# task 01 == Виправте синтаксичні помилки
print("Hello", end = " ")
print("world!")

# task 02 == Виправте синтаксичні помилки
hello = "Hello"
world = "world"
if True:
   print(f"{hello} {world}!")

# task 03  == Вcтавте пропущену змінну у ф-цію print
for letter in "Hello world!":
    print(letter)

# task 04 == Зробіть так, щоб кількість бананів була
# завжди в чотири рази більша, ніж яблук
apples = 2
banana = apples * 4
print (banana)

# task 05 == виправте назви змінних
storona_1 = 1
storona_2 = 2
storona_3 = 3
storona_4 = 4

# task 06 == Порахуйте периметр фігури з task 05
# та виведіть його для користувача
perimetery = storona_1 + storona_2 + storona_3 + storona_4
print(perimetery)


"""
    # Задачі 07 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""

# task 07
"""
У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?
"""
apples = 4
print('У саду посадили 4 яблуні.')
pears = 9
print('Груш на 5 більше яблунь,')
plums = 7
print('а слив - на 2 менше.')

print(f'Скільки всього дерев посадили в саду?')

fruits = apples + pears + plums

print(f'Правильна відповідь така: спочатку маємо 4 яблуні та 5 груш, разом це 4 яблуні і 9 груш.\n'
f'Потім віднімаємо 2 сливи, і оскільки їх стає на дві менше, залишається 7 слив.\n'
f'Тепер додаємо всі фрукти разом: 4 яблуні + 9 груш + 7 слив = {fruits}\n')

# task 8
"""
До обіда температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?
"""

morning = 5
print('До обіда температура повітря була на 5 градусів вище нуля.')
afternoon = 10
print('Після обіду температура опустилася на 10 градусів.')
eveining = 4
print('Надвечір потепліло на 4 градуси. Яка температура надвечір?')
times = (morning - afternoon) + eveining
print(f'Правильна відповідь така: Вранці було +5°C.\n'
f'Після обіду стало холодніше на 10 градусів: 5 - 10 = -5°C.\n'
f'Потім знову потепліло на 4 градуси: -5 + 4 = -1°C.\n'
f'Тож увечері температура була -1°C.)\n')

# task 09
"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скількі сьогодні дітей у театральному гуртку?
"""
boys = 24
girls = int(boys / 2)
print(f'Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.')
print(f'1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.')
print(f'Скількі сьогодні дітей у театральному гуртку?')
people = (boys - 1) + (girls - 2)
print(f'Правильна відповідь така: У гуртку 24 хлопчики.\n'
f'Дівчаток вдвічі менше, отже:\n'
f'24 ÷ 2 = 12 дівчаток.'
f'Один хлопчик захворів, тому хлопчиків стало:\n'
f'24 - 1 = 23.\n'
f'Дві дівчинки не прийшли, тому дівчаток залишилося:\n'
f'12 - 2 = 10.\n'
f'Загалом у гуртку сьогодні:\n'
f'23 + 10 = 33 дітей.\n'
f'Відповідь: Сьогодні у театральному гуртку {people} дитини.\n')

# task 10
"""
Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""
first_book = 8
second_book = 10
third_book = 18
print(f'Перша книжка коштує 8 грн., друга - на 2 грн. дороже, а третя - як половина вартості першої та другої разом.')
books = int((first_book + second_book) / 2)
print(f'Скільки будуть коштувати усі книги, якщо купити по одному примірнику?')
print(f'Розв’язок:\n'
f'Перша книжка коштує 8 грн.\n'
f'Друга на 2 грн дорожча: 8 + 2 = 10 грн.\n'
f'Третя коштує половину суми першої й другої:\n'
f'(8 + 10) ÷ 2 = 9 грн.\n'
f'Усі книжки разом: 8 + 10 + 9 = {books + third_book} грн.\n'
f'Відповідь: Усі книжки коштують {books + third_book} грн.')