# task 1
"""  Уявіть, що інопланетянина з кольором alien_color щойно збили в грі.
Створіть змінну під назвою alien_color і призначте їй значення 'green', 'yellow', або 'red'.
Напишіть оператор if, щоб перевірити, чи колір прибульця 'green'.
Якщо так, надрукуйте повідомлення про те, що гравець щойно заробив 5 балів.
"""
alien_color = input("Якого кольору інопланетянин? ")

if alien_color == "green":
    print("Так, ви щойно заробили 5 балів!") 
elif alien_color == "red": 
    print("Ви програли:(")
elif alien_color == "yellow":
    print("Ви програли:(")



# task 2
"""  Скопіюйте пеопередню відповідь, змініть і доповніть її умовою else.
Якщо колір прибульця зелений, надрукуйте, що гравець щойно заробив 5 балів.
Якщо колір прибульця не зелений, надрукуйте, що гравець щойно заробив 10 балів.
Зробіть так, щоб виводилася умова else.
"""
alien_color = input("Якого кольору інопланетянин? ")
if alien_color == "green":
    print("Так, ви щойно заробили 5 балів!") 
else:
    print("Ви, щойно заробили 10 балів:)")

# task 3
# task 4
"""  Скопіюйте пеопередню відповідь, змініть і доповніть її умовою elif.
змінну під назвою alien_color перетворіть у список значень: 'green', 'yellow', 'red'
Якщо колір прибульця зелений, надрукуйте, що гравець щойно заробив 5 балів.
Якщо колір прибульця не зелений, надрукуйте, що гравець щойно заробив 10 балів.
Якщо прибулець червоний, надрукуйте повідомлення про те, що гравець заробив 15 очок
+ напишіть цикл for що перебере і обробить всі значення списку alien_color
"""

alien_color = ["green", "yellow", "red"]
for i in alien_color:
    if i == "green":
        print("Так, ви щойно заробили 5 балів!") 
    elif i != "green" and i != "red":  # elif i == "yellow":
            print("Так, ви щойно заробили 10 балів!") 
    elif i == "red":
        print("Так, ви щойно заробили 15 балів!")


# task 5
"""  Начинки для піци (pizza_topping): напишіть цикл, який пропонує користувачеві ввести ряд начинок
для піци, доки він не введе значення 'quit'. Коли вони введуть кожну начинку,
надрукуйте повідомлення про те, що ви додасте цю начинку до їхньої піци.
"""
pizza_topping = []
while len(pizza_topping) < 5:
    topping = input("Які начинки ти хочеш? (напишіть 'quit' для виходу): ")
    if topping == "quit":
        print("Ви вийшли зі списку")  
        break
    pizza_topping.append(topping)
print(pizza_topping)


# task 6
"""  Напишіть програму, яка знаходить суму всіх цифр натурального числа, яке вводить користувач.
Для перебору вводу від користувача використовуйте цикл. Виведіть суму цифр числа на екран.
Приклад виконання програми:
Введіть натуральне число: 12345
Сума цифр числа 12345: 15
"""

number = input("Введіть натуральне число: ")
sum = 0
for i in number:
    sum += int(i) 
print(f"Сума цифр числа {number}: {sum}")

# task 7
"""  Потрібно написати програму, яка просить користувача ввести числа, доки він не введе 0.
Програма повинна підрахувати суму всіх введених чисел, окрім 0, і вивести її на екран.
Це повинно працювать як калькулятор, в який ввів цифру - нажав плюс - ввів наступну цифру.
Після введеня 0 показує результат сумування.
Розв'язати з використанням циклу while та break
"""
number = 0
while True:
    print_number = int(input("Введіть, будь ласка, число(для підрахунку введіт 0): "))
    if print_number == 0:
        print("Ви ввели 0, підрахунок завершений")
        break
    number += print_number
print(f"Сума всіх введених чисел: {number}")

# task 8
"""  З використанням циклу for реалізуйте гру "Вгадай число".
Початок програми написаний, гравець має 5 спроб відгадати випадкове число від 1 до 20,
яке було згенеровано за допомогою функції randint() модуля random.
У кожній спробі гравець вводить своє припущення, після чого програма повідомляє, чи
було припущення занадто великим або занадто малим, чи гравець вгадав число.
"""
import random
secret_number = random.randint(1, 20)
guesses = 0
max_guesses = 5
value = range(5)
valid_massage = 5
print("Вгадайте число від 1 до 20 за 5 спроб!")
for i in value:
    print_text = input("Введіть, будь ласка, число: ")
    if print_text == secret_number:
            print(f"Вірно", print_text)
    else: 
        print_text != secret_number
        valid_massage -= 1
        print(f"Ні, у вас залишилсоь", valid_massage, "спроби")
        if valid_massage == 0: 
            print(f"У вас не залишилось спроб, ви програли")


# task 9
"""  Задача з використанням циклу for та continue. Задано список фруктів 'fruits'
потрібно вивести на екран всі елементи списку, окрім "orange".
"""
fruits = ["apple", "banana", "orange", "grape", "mango"]
for i in fruits:
    if i == "orange":
        continue
    print(i)


# task 10
"""  Задано список чисел numbers, потрібно знайти список квадратів
парних чисел зі списку. Спробуйте використати if та цикл for в один рядок.
"""
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
squares = [x**2 for i in numbers if i % 2 == 0]
result = squares
print(result) 