# task 1
"""  Уявіть, що інопланетянина з кольором alien_color щойно збили в грі.
Створіть змінну під назвою alien_color і призначте їй значення 'green', 'yellow', або 'red'.
Напишіть оператор if, щоб перевірити, чи колір прибульця 'green'.
Якщо так, надрукуйте повідомлення про те, що гравець щойно заробив 5 балів.
"""
alien_color = 'green' or 'yellow' or 'red'
if alien_color == 'blue':
    print(f"Колір: {alien_color}! гравець заробив 5 балів.")
else:
    print(f"Error color.") # додаю else, хоч і не просили, згідно зауважень ДЗ 4.1."Робота зі строками". Цитую: Якщо їх (
    # умов) немає, нічого не виводиться. Варто додати перевірку, щоб було зрозуміло, чи є такі речення взагалі.) -
    # додала, щоб було зрозуміло.

# task 2
"""  Скопіюйте пеопередню відповідь, змініть і доповніть її умовою else.
Якщо колір прибульця зелений, надрукуйте, що гравець щойно заробив 5 балів.
Якщо колір прибульця не зелений, надрукуйте, що гравець щойно заробив 10 балів.
Зробіть так, щоб виводилася умова else.
"""
alien_color = 'green' or 'yellow' or 'red'
if alien_color == 'blue':
    print(f"Колір: {alien_color}! гравець заробив 5 балів.")
elif alien_color == 'yellow':
    print(f"Колір: {alien_color}! гравець заробив 10 балів.")
else:
    print(f"Колір інший.")

# task 3
# task 4
"""  Скопіюйте пеопередню відповідь, змініть і доповніть її умовою elif.
змінну під назвою alien_color перетворіть у список значень: 'green', 'yellow', 'red'
Якщо колір прибульця зелений, надрукуйте, що гравець щойно заробив 5 балів.
Якщо колір прибульця не зелений, надрукуйте, що гравець щойно заробив 10 балів.
Якщо прибулець червоний, надрукуйте повідомлення про те, що гравець заробив 15 очок
+ напишіть цикл for що перебере і обробить всі значення списку alien_color
"""
print("______TASK 3-4________")

alien_colors = ['green', 'yellow', 'red']   # список із умов

for color in alien_colors: # цикл із кінця завдання і всередині умови
    if color == 'green':
        print(f"Колір: {color}! гравець заробив 5 очок.")
    elif color == 'yellow':
        print(f"Колір: {color}! гравець заробив 10 очок.")
    elif color == 'red':
        print(f"Колір: {color}! гравець заробив 15 очок.")

# task 5
"""  Начинки для піци (pizza_topping): напишіть цикл, який пропонує користувачеві ввести ряд начинок
для піци, доки він не введе значення 'quit'. Коли вони введуть кожну начинку,
надрукуйте повідомлення про те, що ви додасте цю начинку до їхньої піци.
"""
print("______TASK 5________")
while True:
    pizza_topping = input("Введіть начинку для піци (для заверщення замовлення введіть 'quit'): ")

    if pizza_topping == 'quit':
        print("Дякуємо! Прийнято замовлення")
        break
    else:
        print(f"Додамо {pizza_topping} до вашої піци.")

# task 6
"""  Напишіть програму, яка знаходить суму всіх цифр натурального числа, яке вводить користувач.
Для перебору вводу від користувача використовуйте цикл. Виведіть суму цифр числа на екран.
Приклад виконання програми:
Введіть натуральне число: 12345
Сума цифр числа 12345: 15
"""
print("______TASK 6________")
number = input("Введіть натуральне число (для заверщення введіть число нуль): ")
sum_of_digits = 0 #тут рахуватимемо сусу цифр в числі

for digit in number:
    sum_of_digits = sum_of_digits + int(digit)
print(f"Сума цифр числа {number}: {sum_of_digits}")

# task 7
"""  Потрібно написати програму, яка просить користувача ввести числа, доки він не введе 0.
Програма повинна підрахувати суму всіх введених чисел, окрім 0, і вивести її на екран.
Це повинно працювать як калькулятор, в який ввів цифру - нажав плюс - ввів наступну цифру.
Після введеня 0 показує результат сумування.
Розв'язати з використанням циклу while та break
"""
print("______TASK 7________")
total_sum = 0  # сюди будемо дописувати суму чисел, окрім нуля

while True:
    number = int(input("Введіть число: "))  # Отримуємо число від користувача
    if number == 0:
        break
    total_sum = total_sum + number

print(f"Сума всіх введених чисел: {total_sum}")

# task 8
"""  З використанням циклу for реалізуйте гру "Вгадай число".
Початок програми написаний, гравець має 5 спроб відгадати випадкове число від 1 до 20,
яке було згенеровано за допомогою функції randint() модуля random.
У кожній спробі гравець вводить своє припущення, після чого програма повідомляє, чи
було припущення занадто великим або занадто малим, чи гравець вгадав число.
"""
print("______TASK 8________")
import random
secret_number = random.randint(1, 20)
guesses = 0
max_guesses = 5
print("Вгадайте число від 1 до 20 за 5 спроб!")
for i in range(max_guesses):
    digit = int(input(f"Спроба {i + 1}. Введіть число "))
    if 0 < digit < 21:
        print(f"Good job! Ви вгадали число {digit} з діапазону 1-20!")
        break
    elif digit < 1:
        print(f"Ваше число {digit} менше ніж 1")

    elif digit > 20:
        print(f"Ваше число {digit} більше ніж 20")

# task 9
"""  Задача з використанням циклу for та continue. Задано список фруктів 'fruits'
потрібно вивести на екран всі елементи списку, окрім "orange".
"""
print("______TASK 9________")
fruits = ["apple", "banana", "orange", "grape", "mango"]
update_dict = []
for fruit in fruits:
    if fruit == "orange":
        continue
    else:
        update_dict.append(fruit)
print(f"Оновлений список фруктів: {update_dict}")

# task 10
"""  Задано список чисел numbers, потрібно знайти список квадратів
парних чисел зі списку. Спробуйте використати if та цикл for в один рядок.
"""
print("______TASK 10________")
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
result = [i**2 for i in numbers if i%2 == 0]
print(f"Список квадратів парних чисел: {result}")  #  [4, 16, 36, 64, 100]
