# Завдання 1
"""
Порахувати кількість унікальних символів в строці.
Якщо їх більше 10 - вивести в консоль True, інакше - False.
Строку отримати за допомогою функції input()
"""

input_string = input("Введіть строку: ")
unique_chars = {char for char in input_string}
if len(unique_chars) > 10:
    print("True\n")
else:
    print("False\n")

# Завдання 2
"""
Напишіть цикл, який буде вимагати від користувача ввести слово, 
в якому є літера "h" (враховуються як великі так і маленькі). 
Цикл не повинен завершитися, якщо користувач ввів слово без букви "h".
"""
while True:
    word = input("Введіть слово в якому є літера 'h': ")
    if "h" in word.lower():
        print("Ви ввели правильне слово.\n")
        break
    else:
        print("Слово не містить 'h', спробуйте ще раз.")

# Завдання 3
"""
Є list з даними lst1 = ['1', '2', 3, True, 'False', 5, '6', 7, 8, 'Python', 9, 0, 'Lorem Ipsum']. 
Напишіть код, який сформує новий list (наприклад lst2), який містить лише змінні типу стрінг, які присутні в lst1. 
Данні в лісті можуть бути будь якими
"""
lst1 = ['1', '2', 3, True, 'False', 5, '6', 7, 8, 'Python', 9, 0, 'Lorem Ipsum']
lst2 = [i for i in lst1 if type(i) == str]
print(f"Дані типу стрінг з lst1: {lst2}\n")

# Завдання 4
"""
Є ліст з числами, порахуйте сумму усіх ПАРНИХ чисел в цьому лісті
"""
list_with_numbers = [1, 2, 5, 7, 8, 9, 10]
summ = sum(number for number in list_with_numbers if number % 2 == 0)
print(f"Сума усіх додатніх чисел = {summ}")
